import 'package:flutter_fluffychat_ios/models/chat.dart';
import 'package:flutter_fluffychat_ios/models/user.dart';
import 'package:flutter_fluffychat_ios/models/message.dart';
import 'package:flutter_fluffychat_ios/models/onlineStatus.dart';

List users = [
  User(208435, "Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}),
  User(193721, "Lev Franc", "image", OnlineStatus(true, "10 марта 2021", "10:19"), {"Важная беседа"}),
  User(287202, "Polya Franc", "image", OnlineStatus(false, "10 марта 2021", "10:19"), {"Беседа"}),
  User(258421, "Таня Пушкина", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {}),
  User(186043, "Фёдор Барбарин", "image", OnlineStatus(true, "12 мая 2021", "10:19"), {}),
  User(159327, "Илья Смирнов", "image", OnlineStatus(false, "12 мая 2021", "10:19"), {}),
];


List chats = [
  Chat("Важная беседа",
      [
        208435,
        193721,
        287202
      ],
      [
        Message(208435, "14 мая 2021", "00:09", "Hello", {"Иван Петров", "Polya Franc"}),
        Message(287202, "14 мая 2021", "00:19", "Hello!", {"Иван Петров", "Polya Franc"}),
        Message(208435, "14 мая 2021", "00:29", "Где Лев?", {"Иван Петров", "Polya Franc"})
      ],
      true),

  Chat("tanya pyshka",
      [
        208435,
        287202,
        258421
      ],
      [
        Message(208435, "14 мая 2021", "00:09", "Hello", {"Иван Петров", "Polya Franc"}),
        Message(287202, "14 мая 2021", "00:19", "Hello!", {"Polya Franc"}),
        Message(287202, "14 мая 2021", "00:20", "вы где?", {"Polya Franc"}),
      ],
      true),

  Chat("",
      [
        208435,
        287202
      ],
      [
        Message(208435, "14 мая 2021", "00:09", "мяу", {"Иван Петров", "Lev Franc"}),
        Message(287202, "14 мая 2021", "00:19", "-_-", {"Иван Петров", "Lev Franc"}),
        Message(208435, "14 мая 2021", "00:29", "а что ты хотел от интеллектуала?О.о", {"Иван Петров", "Lev Franc"})
      ],
      false),
  Chat("",
      [
        208435,
        186043
      ],
      [
        Message(208435, "15 мая 2021", "00:09", "Ты где?", {"Иван Петров", "Фёдор Барбарин"}),
        Message(186043, "15 мая 2021", "00:19", "Жди", {"Иван Петров", "Фёдор Барбарин"}),
        Message(186043, "15 мая 2021", "00:49", "Я скоро буду", {"Фёдор Барбарин"})
      ],
      false),
  Chat("Все мы",
      [
        208435,
        186043,
        287202,
        258421,
        193721
      ],
      [
        Message(186043, "15 мая 2021", "00:19", "Погнали гулять", {"Иван Петров", "Фёдор Барбарин", "Polya Franc"}),
        Message(287202, "15 мая 2021", "00:49", "Я скоро буду", {"Иван Петров", "Фёдор Барбарин", "Polya Franc"}),
        Message(208435, "15 мая 2021", "13:45", "Я на месте", { "Фёдор Барбарин", "Иван Петров"}),
      ],
      false),
  Chat("",
      [
        208435,
        159327
      ],
      [
        Message(208435, "15 мая 2021", "00:09", "Ты где?", {"Иван Петров", "Илья Смирнов"}),
        Message(159327, "15 мая 2021", "00:19", "Жди", {"Иван Петров", "Илья Смирнов"}),
        Message(159327, "15 мая 2021", "00:49", "Я скоро буду", {"Илья Смирнов"}),
        Message(208435, "15 мая 2021", "00:49", "Я уже устал", {"Иван Петров"})
      ],
      false),
];