import 'package:flutter_fluffychat_ios/models/chat.dart';
import 'package:flutter_fluffychat_ios/models/user.dart';
import 'package:flutter_fluffychat_ios/models/message.dart';
import 'package:flutter_fluffychat_ios/models/onlineStatus.dart';

List chats = [


  Chat("tanya pyshka",
      {
        User("Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Polya Franc", "image", OnlineStatus(false, "10 марта 2021", "10:19"), {"Беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Таня Пушкина", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
      },
      [
        Message("Иван Петров", "14 мая 2021", "00:09", "Hello", {"Иван Петров", "Polya Franc"}),
        Message("Polya Franc", "14 мая 2021", "00:19", "Hello!", {"Polya Franc"}),
        Message("Polya Franc", "14 мая 2021", "00:20", "вы где?", {"Polya Franc"}),
      ], "1111"),

  Chat("",
      {
        User("Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Lev Franc", "image", OnlineStatus(true, "10 марта 2021", "10:19"), {"Важная беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
      },
      [
        Message("Иван Петров", "14 мая 2021", "00:09", "мяу", {"Иван Петров", "Lev Franc"}),
        Message("Lev Franc", "14 мая 2021", "00:19", "-_-", {"Иван Петров", "Lev Franc"}),
        Message("Иван Петров", "14 мая 2021", "00:29", "а что ты хотел от интеллектуала?О.о", {"Иван Петров", "Lev Franc"})
      ], "2222"),
  Chat("",
      {
        User("Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Фёдор Барбарин", "image", OnlineStatus(true, "12 мая 2021", "10:19"), {}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
      },
      [
        Message("Иван Петров", "15 мая 2021", "00:09", "Ты где?", {"Иван Петров", "Фёдор Барбарин"}),
        Message("Фёдор Барбарин", "15 мая 2021", "00:19", "Жди", {"Иван Петров", "Фёдор Барбарин"}),
        Message("Фёдор Барбарин", "15 мая 2021", "00:49", "Я скоро буду", {"Фёдор Барбарин"})
      ],
      "3333"),
  Chat("Все мы",
      {
        User("Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Фёдор Барбарин", "image", OnlineStatus(true, "12 мая 2021", "10:19"), {}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Polya Franc", "image", OnlineStatus(false, "10 марта 2021", "10:19"), {"Беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Таня Пушкина", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Lev Franc", "image", OnlineStatus(true, "10 марта 2021", "10:19"), {"Важная беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
      },
      [
        Message("Фёдор Барбарин", "15 мая 2021", "00:19", "Погнали гулять", {"Иван Петров", "Фёдор Барбарин", "Polya Franc"}),
        Message("Polya Franc", "15 мая 2021", "00:49", "Я скоро буду", {"Иван Петров", "Фёдор Барбарин", "Polya Franc"}),
        Message("Иван Петров", "15 мая 2021", "13:45", "Я на месте", { "Фёдор Барбарин", "Иван Петров"}),
      ], "4444"),

  Chat("Важная беседа",
      {
        User("Иван Петров", "image", OnlineStatus(true, "14 мая 2021", "00:09"), {"Все мы"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Lev Franc", "image", OnlineStatus(true, "10 марта 2021", "10:19"), {"Важная беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]}),
        User("Polya Franc", "image", OnlineStatus(false, "10 марта 2021", "10:19"), {"Беседа"}, {"Все": ["1111", "2222"], "Непрочитанные": ["3333", "4444"], "Учёба": ["5555"]})
      },
      [
        Message("Иван Петров", "14 мая 2021", "00:09", "Hello", {"Иван Петров", "Polya Franc"}),
        Message("Polya Franc", "14 мая 2021", "00:19", "Hello!", {"Иван Петров", "Polya Franc"}),
        Message("Иван Петров", "14 мая 2021", "00:29", "Где Лев?", {"Иван Петров", "Polya Franc"})
      ], "5555"),
];